In [10]:
import pandas as pd

In [11]:
df=pd.read_csv('salaries.csv',names=)
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [12]:
df['Column']=df.company
df.head()

  company                  job     degree  salary_more_then_100k  Column
0  google      sales executive  bachelors                      0  google
1  google      sales executive    masters                      0  google
2  google     business manager  bachelors                      1  google
3  google     business manager    masters                      1  google
4  google  computer programmer  bachelors                      0  google

In [13]:
df.Column

0         google
1         google
2         google
3         google
4         google
5         google
6     abc pharma
7     abc pharma
8     abc pharma
9     abc pharma
10      facebook
11      facebook
12      facebook
13      facebook
14      facebook
15      facebook
Name: Column, dtype: object